---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralWallProjectionSurface
source: html/65efc1ea-ac85-f6ea-43cd-8a04c6737d5a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralWallProjectionSurface Property

"Horizontal Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralWallProjectionSurface { get; }
```